app/Controllers/BaremeController.php

    public function index()
    {
        $selectedOperateur = $this->request->getGet('operateur');
        $selectedOperation = $this->request->getGet('operation');

        $data = [
            'baremes'            => $this->baremeModel->getBaremesWithDetails($selectedOperateur, $selectedOperation),
            'operateurs'         => $this->operateurModel->findAll(),
            'operations'         => $this->typeOpModel->findAll(),
---
SELECT *
FROM `operateur`
SELECT *
FROM `type_operation`

    public function edit($id)
    {
        $bareme = $this->baremeModel->find($id);

        if (!$bareme) {
            return redirect()->to('/operateur/baremes')->with('error', 'Barème introuvable.');
        }

        $data = [
            'bareme_a_modifier' => $bareme,
            'baremes'           => $this->baremeModel->getBaremesWithDetails(),
            'operations'        => $this->typeOpModel->findAll(),
            'operateurs'        => $this->operateurModel->findAll(),
        ];
---
SELECT *
FROM `bareme`
WHERE `bareme`.`id` = '56'
SELECT *
FROM `operateur`
SELECT *
FROM `type_operation`