app/Controllers/ClientController.php

    public function dashboard()
    {
        if (!$this->session->has('client_numero')) {
            return redirect()->to('/client/login');
        }

        $sessionData = $this->session->get('client_numero');
        $numeroModel = model('App\Models\NumeroModel');
        $compte = $numeroModel->find($sessionData['id']);
---
SELECT *
FROM `numero`
WHERE `numero`.`id` = 1