app/Controllers/PrefixeController.php

SELECT *
FROM `operateur`
SELECT `prefixe`.*, `operateur`.`nom` as `operateur_nom`
FROM `prefixe`
JOIN `operateur` ON `operateur`.`id` = `prefixe`.`id_operateur`
---
    public function index()
    {
        $data = [
            'prefixes'   => $this->prefixeModel->getPrefixesWithOperateurs(),
            'operateurs' => $this->operateurModel->findAll(),
        ];