app/Models/BaremeModel.php

SELECT `bareme`.*, `type_operation`.`nom` as `operation_nom`, `operateur`.`nom` as `operateur_nom`
FROM `bareme`
JOIN `type_operation` ON `type_operation`.`id` = `bareme`.`id_operation`
JOIN `operateur` ON `operateur`.`id` = `bareme`.`id_operateur`
ORDER BY `bareme`.`id_operateur` ASC, `bareme`.`id_operation` ASC, `bareme`.`montant_min` ASC
---
    public function getBaremesWithDetails(?int $idOperateur = null, ?int $idOperation = null): array
    {
        $builder = $this->select('bareme.*, type_operation.nom as operation_nom, operateur.nom as operateur_nom')
                        ->join('type_operation', 'type_operation.id = bareme.id_operation')
                        ->join('operateur', 'operateur.id = bareme.id_operateur');

        if (!empty($idOperateur)) {
            $builder->where('bareme.id_operateur', $idOperateur);
        }

        if (!empty($idOperation)) {
            $builder->where('bareme.id_operation', $idOperation);
        }

        return $builder->orderBy('bareme.id_operateur', 'ASC')
                       ->orderBy('bareme.id_operation', 'ASC')
                       ->orderBy('bareme.montant_min', 'ASC')
                       ->findAll();