app/Models/NumeroModel.php

SELECT *
FROM `numero`
WHERE `numero` = '0343782319'
 LIMIT 1
---
    public function loginAutomatique(string $num)
    {
        $compte = $this->where('numero', $num)->first();