app/Models/PrefixeModel.php

SELECT `prefixe`.*, `operateur`.`nom` as `operateur_nom`
FROM `prefixe`
JOIN `operateur` ON `operateur`.`id` = `prefixe`.`id_operateur`
---
    public function getPrefixesWithOperateurs(): array
    {
        return $this->select('prefixe.*, operateur.nom as operateur_nom')
                    ->join('operateur', 'operateur.id = prefixe.id_operateur')
                    ->findAll();