app/Models/TransactionModel.php

    public function getFrais(string $typeOperation, int $idOperateur, float $montant)
    {
        $db = \Config\Database::connect();
        $row = $db->table('bareme')
                  ->join('type_operation', 'type_operation.id = bareme.id_operation')
                  ->where('type_operation.nom', $typeOperation)
                  ->where('bareme.id_operateur', $idOperateur) // <-- Filtrer par opérateur
                  ->where('montant_min <=', $montant)
                  ->where('montant_max >=', $montant)
                  ->get()
                  ->getRowArray();
---
SELECT *
FROM `bareme`
JOIN `type_operation` ON `type_operation`.`id` = `bareme`.`id_operation`
WHERE `type_operation`.`nom` = 'TRANSFERT'
AND `bareme`.`id_operateur` = 1
AND `montant_min` <= 1000
AND `montant_max` >= 1000

            ]);

            // On recharge le destinataire tout juste créé pour la suite du script
            $dest = $numeroModel->find($idNumeroDest);
---
SELECT *
FROM `numero`
WHERE `numero`.`id` = 3

        $db = \Config\Database::connect();
        $db->transStart();

        $op = $db->table('type_operation')->where('nom', 'TRANSFERT')->get()->getRowArray();
---
SELECT *
FROM `type_operation`
WHERE `nom` = 'TRANSFERT'

        }

        // Mouvements de soldes
        $db->table('numero')->where('id', $idSource)->decrement('solde', $totalADeduire);
---
UPDATE `numero` SET `solde` = `solde` + 1000
WHERE `id` = 1