app/Models/TransactionModel.php

SELECT `transaction_mm`.*, `type_operation`.`nom` as `type_nom`
FROM `transaction_mm`
JOIN `type_operation` ON `type_operation`.`id` = `transaction_mm`.`id_operation`
WHERE `id_numero_source` = 3
OR `id_numero_destination` = 3
ORDER BY `date_transaction` DESC
---
    public function getHistoriqueClient(int $idNumero)
    {
        return $this->select('transaction_mm.*, type_operation.nom as type_nom')
            ->join('type_operation', 'type_operation.id = transaction_mm.id_operation')
            ->where('id_numero_source', $idNumero)
            ->orWhere('id_numero_destination', $idNumero)
            ->orderBy('date_transaction', 'DESC')
            ->findAll();

SELECT *
FROM `bareme`
JOIN `type_operation` ON `type_operation`.`id` = `bareme`.`id_operation`
WHERE UPPER(type_operation.nom) = 'TRANSFERT'
AND `bareme`.`id_operateur` = 1
AND `bareme`.`montant_min` <= 10000
AND `bareme`.`montant_max` >= 10000
SELECT *
FROM `commission_interoperateur`
WHERE `id_operateur_source` = 1
AND `id_operateur_dest` = 3
---
    public function getFrais(string $typeOperation, int $idOpSource, int $idOpDest = 0, float $montant = 0.0)
    {
        $db = \Config\Database::connect();

        // 1. Frais de base (Barème)
        $row = $db->table('bareme')
            ->join('type_operation', 'type_operation.id = bareme.id_operation')
            ->where('UPPER(type_operation.nom)', strtoupper($typeOperation))
            ->where('bareme.id_operateur', $idOpSource)
            ->where('bareme.montant_min <=', $montant)
            ->where('bareme.montant_max >=', $montant)
            ->get()
            ->getRowArray();

        $fraisBase = $row ? (float)$row['frais'] : 0.00;

        // 2. Ajout de la commission si inter-opérateur
        if (strtoupper($typeOperation) === 'TRANSFERT' && $idOpDest > 0 && $idOpSource !== $idOpDest) {
            $configCommission = $db->table('commission_interoperateur')
                ->where('id_operateur_source', $idOpSource)
                ->where('id_operateur_dest', $idOpDest)
                ->get()
                ->getRowArray();

SELECT *
FROM `numero`
WHERE `numero` = '0341234567'
 LIMIT 1
---
    public function executerRetrait(int $idNumero, float $montant)
    {
        $numeroModel = model('App\Models\NumeroModel');
        $compte = $numeroModel->find($idNumero);

SELECT *
FROM `numero`
WHERE `numero` = '0339876543'
 LIMIT 1
SELECT *
FROM `numero`
WHERE `numero`.`id` = 1
SELECT *
FROM `commission_interoperateur`
WHERE `id_operateur_source` = 1
AND `id_operateur_dest` = 3
---
   public function executerTransfert($idSource, $numDest, $montant, $fraisChek)
{
    $numeroModel = new NumeroModel();
    $dest = $numeroModel->where('numero', $numDest)->first();

    $db = \Config\Database::connect();

    // 1. Initialisation par défaut
    $fraisRetrait = 0;

    // 2. Vérifications de base du destinataire
    if (!$dest) {
        return "numero_inexistant";
    }

    if ($dest['etat'] === 'BLOQUE') {
        return 'dest_introuvable';
    }

    if ($idSource === (int)$dest['id']) {
        return 'impossible_soi_meme';
    }

    $source = $numeroModel->find($idSource);

    // 3. Autorisation inter-opérateur (si opérateurs différents)
    if ((int)$source['id_operateur'] !== (int)$dest['id_operateur']) {
        $configCommission = $db->table('commission_interoperateur')
            ->where('id_operateur_source', (int)$source['id_operateur'])
            ->where('id_operateur_dest', (int)$dest['id_operateur'])
            ->get()
            ->getRowArray();

SELECT *
FROM `type_operation`
WHERE UPPER(nom) = 'TRANSFERT'
---
    // 8. Transaction SQL
    $db->transStart();

    $op = $db->table('type_operation')->where('UPPER(nom)', 'TRANSFERT')->get()->getRowArray();

UPDATE `numero` SET `solde` = `solde`-10300
WHERE `id` = 1
UPDATE `numero` SET `solde` = `solde` + 10000
WHERE `id` = 2
---
    }

    // Le compte émetteur paie (Montant + Frais Envoi + Frais Retrait éventuels)
    $db->table('numero')->where('id', $idSource)->decrement('solde', $totalADeduire);

    // Le destinataire reçoit la somme exacte envoyée
    $db->table('numero')->where('id', $dest['id'])->increment('solde', $montant);

SELECT COUNT(t.id) as total_transactions, COALESCE(SUM(t.frais), 0) as total_gains
FROM `transaction_mm` `t`
LEFT JOIN `numero` `ns` ON `ns`.`id` = `t`.`id_numero_source`
LEFT JOIN `numero` `nd` ON `nd`.`id` = `t`.`id_numero_destination`
WHERE   (
`nd`.`id_operateur` = 1
OR `t`.`id_numero_destination` IS NULL
 )
AND `ns`.`id_operateur` = 1
---
public function getGainsInternesTelma(int $idTelma = 1)
{
    $builder = $this->db->table('transaction_mm t')
        ->select('COUNT(t.id) as total_transactions, COALESCE(SUM(t.frais), 0) as total_gains')
        ->join('numero ns', 'ns.id = t.id_numero_source', 'left')
        ->join('numero nd', 'nd.id = t.id_numero_destination', 'left')
        ->groupStart()
            ->where('nd.id_operateur', $idTelma)
            ->orWhere('t.id_numero_destination IS NULL')
        ->groupEnd()
        ->where('ns.id_operateur', $idTelma);

    return $builder->get()->getRowArray() ?: ['total_transactions' => 0, 'total_gains' => 0];

SELECT COUNT(t.id) as total_transactions, COALESCE(SUM(t.frais), 0) as total_gains
FROM `transaction_mm` `t`
LEFT JOIN `numero` `ns` ON `ns`.`id` = `t`.`id_numero_source`
LEFT JOIN `numero` `nd` ON `nd`.`id` = `t`.`id_numero_destination`
WHERE `ns`.`id_operateur` = 1
AND `nd`.`id_operateur` IS NOT NULL
AND `nd`.`id_operateur` != 1
---
public function getGainsExternesTelma(int $idTelma = 1)
{
    $builder = $this->db->table('transaction_mm t')
        ->select('COUNT(t.id) as total_transactions, COALESCE(SUM(t.frais), 0) as total_gains')
        ->join('numero ns', 'ns.id = t.id_numero_source', 'left')
        ->join('numero nd', 'nd.id = t.id_numero_destination', 'left')
        ->where('ns.id_operateur', $idTelma)
        ->where('nd.id_operateur IS NOT NULL')
        ->where('nd.id_operateur !=', $idTelma);

    return $builder->get()->getRowArray() ?: ['total_transactions' => 0, 'total_gains' => 0];

SELECT `op`.`nom` as `nom_operateur`, COUNT(t.id) as total_transferts, COALESCE(SUM(t.montant * (COALESCE(c.pourcentage, 0) / 100.0)), 0) as total_a_reverser
FROM `transaction_mm` `t`
LEFT JOIN `numero` `ns` ON `ns`.`id` = `t`.`id_numero_source`
LEFT JOIN `numero` `nd` ON `nd`.`id` = `t`.`id_numero_destination`
LEFT JOIN `operateur` `op` ON `op`.`id` = `nd`.`id_operateur`
LEFT JOIN `commission_interoperateur` `c` ON `c`.`id_operateur_source` = `ns`.`id_operateur` AND `c`.`id_operateur_dest` = `nd`.`id_operateur`
WHERE `ns`.`id_operateur` = 1
AND `nd`.`id_operateur` IS NOT NULL
AND `nd`.`id_operateur` != 1
GROUP BY `op`.`id`, `op`.`nom`, `c`.`pourcentage`
---
public function getMontantsAEnvoyerParOperateur(int $idTelma = 1)
{
    return $this->db->table('transaction_mm t')
        ->select('
            op.nom as nom_operateur,
            COUNT(t.id) as total_transferts,
            COALESCE(SUM(t.montant * (COALESCE(c.pourcentage, 0) / 100.0)), 0) as total_a_reverser
        ')
        ->join('numero ns', 'ns.id = t.id_numero_source', 'left')
        ->join('numero nd', 'nd.id = t.id_numero_destination', 'left')
        ->join('operateur op', 'op.id = nd.id_operateur', 'left')
        ->join(
            'commission_interoperateur c',
            'c.id_operateur_source = ns.id_operateur AND c.id_operateur_dest = nd.id_operateur',
            'left'
        )
        ->where('ns.id_operateur', $idTelma)
        ->where('nd.id_operateur IS NOT NULL')
        ->where('nd.id_operateur !=', $idTelma)
        ->groupBy('op.id, op.nom, c.pourcentage')
        ->get()
        ->getResultArray();

SELECT `t`.*, `ns`.`numero` as `numero_source`, `c`.`nom` as `nom_client`, `op`.`nom` as `nom_operation`
FROM `transaction_mm` `t`
LEFT JOIN `numero` `ns` ON `ns`.`id` = `t`.`id_numero_source`
LEFT JOIN `client` `c` ON `c`.`id` = `ns`.`id_client`
LEFT JOIN `type_operation` `op` ON `op`.`id` = `t`.`id_operation`
WHERE   (
`ns`.`id_operateur` = 1
OR `t`.`id_numero_source` IS NULL
 )
AND UPPER(t.statut) IN ('SUCCES','SUCCESS')
ORDER BY `t`.`id` DESC
---
    public function getDetailGainsOperateur(int $idOperateur = 1)
    {
        return $this->db->table('transaction_mm t')
            ->select('t.*,
                      ns.numero as numero_source,
                      c.nom as nom_client,
                      op.nom as nom_operation')
            ->join('numero ns', 'ns.id = t.id_numero_source', 'left')
            ->join('client c', 'c.id = ns.id_client', 'left')
            ->join('type_operation op', 'op.id = t.id_operation', 'left')
            ->groupStart()
                ->where('ns.id_operateur', $idOperateur)
                ->orWhere('t.id_numero_source IS NULL') // Inclut aussi les dépôts
            ->groupEnd()
            ->whereIn('UPPER(t.statut)', ['SUCCES', 'SUCCESS'])
            ->orderBy('t.id', 'DESC')
            ->get()
            ->getResultArray();